Show / Hide Table of Contents
Class RebarSegment3DBase
Represents a segment in 3D space.
Inheritance
System.Object
OpenObject
RebarSegment3DBase
RebarSegment3DArc3Pts
RebarSegment3DLine
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class RebarSegment3DBase : OpenObject
Properties
Improve this Doc   View Source
EndPoint
Gets or sets the endpoint of the segment.
Declaration
public RebarPoint3D EndPoint { get; set; }
Property Value
 Type |  Description
 RebarPoint3D
 Improve this Doc
 View Source